# filename: ex057.rq

PREFIX ab: <http://learningsparql.com/ns/addressbook#> 

SELECT ?first ?last ?workTel
WHERE
{
  ?s ab:firstName ?first ;
     ab:lastName ?last .
  OPTIONAL 
  { ?s ab:workTel ?workTel . }
}

---------------------------------------------
| first| last| workTel|
=============================================
| "Craig"| "Ellis"| "(245) 315-5486" |
| "Cindy"| "Marshall" |              |
| "Richard" | "Mutt"  |              |
---------------------------------------------