# filename: ex006.rq

SELECT ?craigEmail
WHERE
{
  <http://learningsparql.com/ns/addressbook#craig> 
  <http://learningsparql.com/ns/addressbook#email> 
  ?craigEmail . 
}


--------------------------------
| craigEmail|
================================
| "c.ellis@usairwaysgroup.com" |
| "craigellis@yahoo.com"|
--------------------------------
